# BuiltInFailures.MEPFabricationFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures Class
BuiltInFailures Class Members See Also
---
Failures about MEP fabrication.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class MEPFabricationFailures
```

Visual Basic
---
```text
Public NotInheritable Class MEPFabricationFailures
```

Visual C++
---
```text
public ref class MEPFabricationFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..MEPFabricationFailures
# See Also
BuiltInFailures..::..MEPFabricationFailures Members
Autodesk.Revit.DB Namespace